Revit 2024 API
ParameterTypeId.CutLineExtension Property
 "Cut Line Extension"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CutLineExtension { get; }
Visual Basic
Public Shared ReadOnly Property CutLineExtension As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CutLineExtension {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace